Revit 2024 API
FormatOptions.CanSuppressSpaces Method (ForgeTypeId)
 Checks whether spaces can be suppressed for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool CanSuppressSpaces(
	ForgeTypeId unitTypeId
)
Visual Basic
Public Shared Function CanSuppressSpaces ( _
	unitTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool CanSuppressSpaces(
	ForgeTypeId^ unitTypeId
)
Parameters
unitTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the unit.
Return Value
 True if spaces can be suppressed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormatOptions Class
CanSuppressSpaces Overload
Autodesk.Revit.DB Namespace